[
    {
        "rank": "11",
        "company_name": "TENCENT",
        "company_domain": "https://www.tencent.com",
        "company_summary": "Tencent Holdings is China based Multi-National Investment Conglomerate Company. Tencent is a leading provider of Internet value added services in China. Headquarters is in China.\nTencent is mainly into businesses related to Video Games, Online Games, Social Media, eCommerce, Payment Systems.",
        "market_cap": "392.350 Billion USD"
    },
    {
        "rank": "12",
        "company_name": "TESLA",
        "company_domain": "https://www.tesla.com/",
        "company_summary": "Tesla is USA based Electric Automobile company, Solar Panels, Battery cells, Energy Storage Products manufacturing company and they manufacture Electric Cars, Electric Batteries, Solar Panels & Clean Energy Storage. Tesla is a company of Elon Musk who is owner of SpaceX and this SpaceX is capable of sending rockets to moon privately. Tesla is World's Famous company in manufacturing electric cars at affordable price. Headquarters is in USA.\nAs on July-30-2023, Tesla market cap was 844 Billion USD and it is World Top 7th company by market cap.",
        "market_cap": "388.880 Billion USD"
    },
    {
        "rank": "13",
        "company_name": "TAIWAN SEMICONDUCTOR MANUFACTURING COMPANY (TSMC)",
        "company_domain": "https://www.tsmc.com/",
        "company_summary": "Taiwan Semiconductor Manufacturing Company (TSMC) is the world’s largest semiconductor company with headquarters in Taiwan.\nAs on July-30-2023, TSMC market cap was 523 Billion USD and it is World Top 10th company by market cap.\nTSMC deployed 281 distinct process technologies, and manufactured 11,617 products for 510 customers in 2020.",
        "market_cap": "388.380 Billion USD"
    },
    {
        "rank": "14",
        "company_name": "WALMART",
        "company_domain": "https://www.walmart.com/",
        "company_summary": "Walmart is World's biggest retail market company and it has eCommerce business as well along with brick and mortar Retail stores. Around the world as on Jan-2022, 2.3 million employees are working for Walmart. In the U.S., where about 90% of the population lives within 10 miles of a Walmart store or Sam’s Club. Headquarters is in USA.",
        "market_cap": "387.720 Billion USD"
    },
    {
        "rank": "15",
        "company_name": "J P MORGAN CHASE & CO",
        "company_domain": "https://www.jpmorganchase.com/",
        "company_summary": "JPMorgan Chase is one of the oldest financial institutions in the United States With a history dating back over 200 years.\nJPMorgan Chase is a leading global financial services firm with assets of $2.6 trillion.\nJPMorgan have a presence in over 100 markets.\nHeadquarters is in USA.\nAs on 2022, JPMorgan Chase has 293,723 employees.\nJPMorgan Chase annual revenue generated for period ending Dec-2022 was 128.69 billion USD.",
        "market_cap": "385.070 Billion USD"
    },
    {
        "rank": "16",
        "company_name": "NVIDIA CORPORATION",
        "company_domain": "http://www.nvidia.com/",
        "company_summary": "Nvidia Corporation is famous for Graphics, 3D Graphics Cards and Drivers. Nvidia is leading the way in AI computing. Nvidia GPUs simulate human intelligence powering systems that can perceive and understand the world. \nAs on July-30-2023, Nvidia Corporation market cap was 1.15 Trillion USD and it is World Top 6th company by market cap.",
        "market_cap": "374.070 Billion USD"
    },
    {
        "rank": "17",
        "company_name": "LVMH",
        "company_domain": "https://www.lvmh.com/",
        "company_summary": "LVMH group manufacture luxury goods and quality products in five major sectors of the luxury market:  Wines & Spirits, Fashion & Leather Goods, Perfumes & Cosmetics, Watches & Jewelry and Selective Retailing. LVMH has 150,000 employees as on 2021 across the world and reported sales of 53.65 billion euros in 2019.",
        "market_cap": "364.190 Billion USD"
    },
    {
        "rank": "18",
        "company_name": "PROCTER & GAMBLE COMPANY",
        "company_domain": "https://pg.com/",
        "company_summary": "Procter & Gamble Company is one of World's top FMCG Company with Baby Care, Fabric Care, Family Care, Feminine Care, Hair Care, Home Care, Grooming, Personal Health Care, Oral Care, Skin and Personal Care Products. Headquarters is in USA.",
        "market_cap": "361.660 Billion USD"
    },
    {
        "rank": "19",
        "company_name": "ELI LILLY AND COMPANY",
        "company_domain": "https://www.lilly.com/",
        "company_summary": "Eli Lilly is a healthcare and pharmaceutical and is USA based MNC company. Key business areas are Oncology, Bio-Medicines, Diabetes and also Animals Health.and Lilly unites caring with discovery to create medicines that make life better for people around the world. Eli Lilly has 33,815 employees as on 2019. Headquarters is in USA.\nThree long-established core values guide Lilly :\nIntegrity.\nExcellence.\nRespect for People.\nFacts About Lilly:",
        "market_cap": "349.570 Billion USD"
    },
    {
        "rank": "20",
        "company_name": "CHEVRON CORPORATION",
        "company_domain": "https://www.chevron.com/",
        "company_summary": "Chevron Corporation is USA based Multi-National Energy Company. Chevron is one of the world’s leading integrated energy companies producing safe, reliable energy now and for the future. It  deliver affordable, reliable and ever-cleaner energy – essential to modern life for billions of people around the world. Headquarters is in USA.",
        "market_cap": "343.030 Billion USD"
    }
]